[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "category_id": "01",
    "title": "React.js - Building the Frontend",
    "author": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://coderstrustbd.com/wp-content/uploads/2021/08/react-js-banner.jpg",
    "details": "React.js is a powerful frontend javascript library.You can create almost any application of frontend.React.js Developed by Facebook and maintained by Facebook.React.js is the most popular frontend library in 2022 and probably it will stay popular in the future.Learn React.js by creating React real world applications and learn it easiest way with us."
  },

  {
    "_id": "f69a695f037cd9484cecaea37ca71012",
    "category_id": "02",
    "title": "The Angular Firebase Project Course",
    "author": {
      "name": "Jennifer Wood",
      "published_date": "2022-08-30 16:38:45",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
    "image_url": "https://fireship.io/courses/angular/img/featured.png",
    "details": "The Angular Firebase PWA Course will teach you how to build a complex progressive web app with Angular 12 (ivy), Material Design, and Firebase. It starts from absolute basics and eventually culminates with the deployment of a server-rendered PWA on Google Cloud Run.You will build a full-stack Kanban (看板) storyboard app inspired by Trello. Authenticated users can create, sort, update, and delete boards with all interaction persisted in Firestore."
  },

  {
    "_id": "11468ed61aee84de492a8b04158a22f0",
    "category_id": "01",
    "title": "Hands-On React. Build advanced React JS Frontend with expert",
    "author": {
      "name": "system",
      "published_date": "2022-08-24 23:15:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
    "image_url": "https://i.ytimg.com/vi/MfIoAG3e7p4/maxresdefault.jpg",
    "details": "React is the most popular library for building frontend web applications. Step-by-step by diving into all the basics, we'll introduce you to advanced concepts as well.React is not a framework. It is just a library developed by Facebook to solve some problems that we were facing earlier. Before going into depth there are few things to understand in react, those are like Code-Splitting, Fragments, DOM, etc. Having knowledge on these topics will let you understand the core."
  },

  {
    "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
    "category_id": "02",
    "title": "Angular (Full App) with Angular Material, Angularfire & NgRx",
    "author": {
      "name": "Philo carter",
      "published_date": "2022-08-30 15:00:04",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
    "image_url": "https://i.ytimg.com/vi/2OHbjep_WjQ/maxresdefault.jpg",
    "details": "Angular is an amazing frontend JavaScript & TypeScript framework with which you can build powerful web applications.There are a lot of courses that dive deeply into Angular but sometimes you just want to build an entire app and see how it all works in practice. And you want to use all these great third-party packages that can add a lot of awesome functionalities to your Angular app!This course covers exactly that!We'll build an entire, realistic app which looks absolutely beautiful, uses Google's Material Design and is extremely fast! Thanks to Firebase and Angularfire, we'll add real-time database functionalities and see our updates almost before we make them!Behind the scenes, NgRx will be used - a Redux-inspired state management solution that can greatly enhance your Angular app."
  },

  {
    "_id": "a713ee936ff5574273f0f769f5c5b20e",
    "category_id": "03",
    "title": "MongoDB - The Complete Developer's Guide 2022",
    "author": {
      "name": "system",
      "published_date": "2022-08-30 15:00:04",
      "img": "https://www.openlogic.com/sites/default/files/image/2021-06/image-blog-openlogic-what-is-mongodb.png"
    },
    "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
    "image_url": "https://webimages.mongodb.com/_com_assets/cms/kuzt9r42or1fxvlq2-Meta_Generic.pnghttps://webimages.mongodb.com/_com_assets/cms/kuzt9r42or1fxvlq2-Meta_Generic.png",
    "details": "MongoDB is an open-source document database and leading NoSQL database. MongoDB is written in C++. This tutorial will give you great understanding on MongoDB concepts needed to create and deploy a highly scalable and performance-oriented database.This tutorial is designed for Software Professionals who are willing to learn MongoDB Database in simple and easy steps. It will throw light on MongoDB concepts and after completing this tutorial you will be at an intermediate level of expertise, from where you can take yourself at higher level of expertise."
  },

  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
    "category_id": "04",
    "title": "Just Express (with a bunch of node and http). In detail.",
    "author": {
      "name": "Theo Minh Châu",
      "published_date": "2022-08-25 06:03:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/j86wjDW/unsplash-Eh-Tc-C9s-YXsw-20.png",
    "image_url": "https://miro.medium.com/max/805/0*m1VOQP0FtcQufLgw.png",
    "details": "In this full Express.js course from Buzz Team, you will learn how to develop a web app from scratch using Node.js, Express.js, PostgreSQL, and Bootstrap. The web app is a full CRUD application that is used for collecting sales leads.This course is the perfect way to become familiar with Express.js and how to use it with Node.js. Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications."
  },

  {
    "_id": "f06f8cc035b04bd1158e4198281915a4",
    "category_id": "05",
    "title": "NodeJS - The Complete Guide (MVC, REST APIs, GraphQL, Deno)",
    "author": {
      "name": "Ukrainska Pravda",
      "published_date": "2022-08-25 18:53:49",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
    "image_url": "https://bs-uploads.toptal.io/blackfish-uploads/components/seo/content/og_image_file/og_image/777184/secure-rest-api-in-nodejs-18f43b3033c239da5d2525cfd9fdc98f.png",
    "details": "JavaScript is one of the most popular programming languages. The powerful Node.js runtime environment has been ranked the technology most commonly used by professional developers. Node.js is an event-driven JavaScript runtime. Node has myriad potential uses for JavaScript development including being a great environment for building efficient network applications.This course is a great introduction to the concepts of server-side web development. You’ll learn the different parts that make up the back-end of a website or web application, and you’ll gain familiarity with the Node.js runtime environment.”"
  },

  {
    "_id": "cd2b53655737cc4077542baea9f8f75d",
    "category_id": "02",
    "title": "Build an app with ASPNET Core and Angular from scratch",
    "author": {
      "name": "Daniel Deangelo",
      "published_date": "2022-08-30 20:02:52",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://www.mattspaulding.org/images/dotnet-core-angular.jpg",
    "details": "Want to build your own web application? In this course, Ervis Trupja shows you how, explaining what it takes to create a web app using Angular, the popular JavaScript framework, for the front end and the ASP.NET Web API for the back end. Ervis steps through how to build the service layer with the ASP.NET Web API to expose the required endpoints to create, read, update, and delete entries. He then shows how to build a UI using Angular with Bootstrap; implement NgRx—a framework for building reactive applications in Angular—in your app; and handle different user authentication cases with Auth0."
  },

  {
    "_id": "acb9b6785b62698fc6130db7615965e1",
    "category_id": "03",
    "title": "Complete MongoDB Administration Guide",
    "author": {
      "name": "RTTNews",
      "published_date": "2022-08-25 11:53:13",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/1vcgPzg/unsplash-Eh-Tc-C9s-YXsw-12.png",
    "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2020/04/MongoDB-Administration.jpg",
    "details": "We'll start together with the ultimate basics, learning what a database is and recognizing what makes MongoDB different in the database space. Then you'll move on to working with data as you grasp the difference between BSON and JSON and start to import, export and query. Next you'll absorb how to create and manipulate documents with hands-on learning, and skill-up to mastering advanced Create Read Update Delete (CRUD) operations. By this time you'll be ready to work on Indexing, Data Modeling, and creating an Aggregation Pipeline. Lastly you'll have the opportunity to explore the Atlas UI in more detail, investigate the Charts functionality and Realm, as well as explore the use of Compass."
  },
  {
    "_id": "be44c843d61859cc0b87cae85c55f9db",
    "category_id": "01",
    "title": "Modern React with Redux",
    "author": {
      "name": "Kumar Natasha",
      "published_date": "2022-08-26 12:15:36",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
    "image_url": "https://res.cloudinary.com/practicaldev/image/fetch/s--xItnNQcN--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://dev-to-uploads.s3.amazonaws.com/i/1aaz55rk5209bsosaaqt.jpg",
    "details": "The Redux docs are intended to teach the basic concepts of Redux, as well as explain key concepts for use in real-world applications. However, the docs can't cover everything. Happily, there are many other great resources available for learning Redux. We encourage you to check them out. Many of them cover topics that are beyond the scope of the docs, or describe the same topics in other ways that may work better for your learning style.Master the fundamentals of React and Redux with this tutorial as you develop apps with React Router, Webpack, and ES6."
  },

  {
    "_id": "61f9ce168f7b15aadecb1d1fc80c72f0",
    "category_id": "05",
    "title": "Node JS: Advanced Concepts",
    "author": {
      "name": "Alex Decocts",
      "published_date": "2022-08-26 00:37:24",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "thumbnail_url": "https://i.ibb.co/L507x2V/unsplash-Eh-Tc-C9s-YXsw-14.png",
    "image_url": "https://creator-assets.codedamn.com/codedamn-61897bfe60f1140008feb00d/course-image/2022-09-23/13ea008213599bd4b103132cdd594ec7835f0391",
    "details": "Go beyond the basics of Node!  This course will give you the skills needed to become a top Node engineer.Query Caching with Redis? You will learn it.  The Node Event Loop? Included.  Scalable File Upload? Of course!Master the Node Event Loop - understand how Node executes your source code. Understand the purpose of Node, and how the code you write is eventually executed by  C++ code in the V8 engine.Add a huge boost to performance in your Node app through clustering and worker threads.Turbocharge MongoDB queries by adding query caching backed by a lightning-fast Redis instance.Scale your app to infinity with image and file upload backed by Amazon's S3 file service.Implement a continuous integration testing pipeline so you always know your project functions properly.Think you know everything there is about managing  cookies and session?  Well, you might, but learn even more!Ensure your app works the way you expect with automated browser testing using Jest and Puppeteer.Bonus - learn advanced JS techniques along the way, including where to use ES2015 proxies!"
  }
]
